{
  "schema_summary": {
    "rows": 50000,
    "cols": 2,
    "dtypes": {
      "review": "object",
      "sentiment": "object"
    },
    "null_counts": {
      "review": 0,
      "sentiment": 0
    },
    "nunique": {
      "review": 49582,
      "sentiment": 2
    },
    "high_cardinality_candidates": [
      "review"
    ]
  },
  "memory_summary": {
    "total_bytes": 81545617.0,
    "per_column_bytes": {
      "review": 78295485.0,
      "sentiment": 3250000.0
    }
  },
  "duplicate_summary": {
    "duplicate_rows": 418,
    "duplicate_rows_pct": 0.836
  },
  "datetime_overview": {
    "datetime_columns": []
  },
  "numeric_stats": {
    "n_numeric": 0,
    "columns": {},
    "pearson_corr_top": []
  },
  "categorical_stats": {
    "n_categorical": 2,
    "columns": {
      "review": {
        "nunique": 49582,
        "top_values": {
          "Loved today's show!!! It was a variety and not solely cooking (which would have been great too). Very stimulating and captivating, always keeping the viewer peeking around the corner to see what was coming up next. She is as down to earth and as personable as you get, like one of us which made the show all the more enjoyable. Special guests, who are friends as well made for a nice surprise too. Loved the 'first' theme and that the audience was invited to play along too. I must admit I was shocked to see her come in under her time limits on a few things, but she did it and by golly I'll be writing those recipes down. Saving time in the kitchen means more time with family. Those who haven't tuned in yet, find out what channel and the time, I assure you that you won't be disappointed.": 5,
          "Hilarious, clean, light-hearted, and quote-worthy. What else can you ask for in a film? This is my all-time, number one favorite movie. Ever since I was a little girl, I've dreamed of owning a blue van with flames and an observation bubble.<br /><br />The cliché characters in ridiculous situations are what make this film such great fun. The wonderful comedic chemistry between Stephen Furst (Harold) and Andy Tennant (Melio) make up most of my favorite parts of the movie. And who didn't love the hopeless awkwardness of Flynch? Don't forget the airport antics of Leon's cronies, dressed up as Hari Krishnas: dancing, chanting and playing the tambourine--unbeatable! The clues are genius, the locations are classic, and the plot is timeless.<br /><br />A word to the wise, if you didn't watch this film when you were little, it probably won't win a place in your heart today. But nevertheless give it a chance, you may find that \"It doesn't matter what you say, it doesn't matter what you do, you've gotta play.\"": 4,
          "Robert Jordan is a television star. Robert Jordan likes things orderly, on time and properly executed. In his world children are to be seen, not heard. So why would Mr. Jordan want to become the master of a rambunctious band of Boy Scouts? Ratings. His staff figures that if learns how to interact with the youth, they will be more inclined to watch his show. Of course watching Jordan cope comprises most of the fun.<br /><br />Like Mr. Belvedere and Mr. Belvedere Goes to College this one is sure to please.<br /><br />ANYONE INTERESTED IN OBTAINING A COPY OF THIS FILM PLEASE WRITE TO ME AT: IAMASEAL2@YAHOO.COM": 3,
          "You do realize that you've been watching the EXACT SAME SHOW for eight years, right? I could understand the initial curiosity of seeing strangers co-exist on an Island, but you'd think that after watching unkempt, stink-ladened heroes run roughshod through the bush with an egg on a spoon for half a decade would be enough to get you to commit to something a little more original (and interesting).<br /><br />And I'm not even speaking of the shows validity which for the record I find questionable. It's just hard to suspend disbelief for \"Bushy Bill\" eating a rat when the entire crew of producers and camera people are housed in an air conditioned make-shift bio-dome sipping frosty mochcinno's with moxy.<br /><br />What's the appeal here? I don't care about these people or their meandering lives. I just don't get it. But if you DO find yourself being captivated by hairy, unwashed people, I suggest you turn off your TV and just take a trip to your local bus station where you can see people like this in their TRUE habitat. They call them HOMELESS PEOPLE, and free of charge, you can sit back and marvel in their uncanny ability to retrieve various cigarette debris from a plethora of garbage canisters, eventually striking \"pay-dirt\" and fashioning a homemade Dr. Frankenstein-styled cancer-stick, all the while begging people for change for food when the stink of \"Aqua Velva\" on their breath is enough to suggest otherwise. And the best part? Much like Survivor, every week one member of the tribe \"Leaves\" the \"Island\" when they are unceremoniously sent packing to the local Institution when the frightening unmedicated state of full-blown schizophrenia kicks into gear! Now THAT'S ENTERTAINMENT!": 3,
          "How has this piece of crap stayed on TV this long? It's terrible. It makes me want to shoot someone. It's so fake that it is actually worse than a 1940s sci-fi movie. I'd rather have a stroke than watch this nonsense. I remember watching it when it first came out. I thought, hey this could be interesting, then I found out how absolutely, insanely, ridiculously stupid it really was. It was so bad that I actually took out my pocket knife and stuck my hand to the table.<br /><br />Please people, stop watching this and all other reality shows, they're the trash that is jamming the networks and canceling quality programming that requires some thought to create.": 3,
          "Nickelodeon has gone down the toilet. They have kids saying things like \"Oh my God!\" and \"We're screwed\"<br /><br />This show promotes hate for people who aren't good looking, or aren't in the in crowd. It say that sexual promiscuity is alright, by having girls slobbering over shirtless boys. Not to mention the overweight boy who takes off his shirt. The main characters basically shun anyone out of the ordinary. Carly's friend Sam, who may be a lesbian, beats the snot out of anybody that crosses her path, which says it's alright to be a b**ch. This show has so much negativity in it that nobody should watch it! I give it a 0 out of 10!!!": 3,
          "This show comes up with interesting locations as fast as the travel channel. It is billed as reality but in actuality it is pure prime time soap opera. It's tries to use exotic locales as a facade to bring people into a phony contest & then proceeds to hook viewers on the contestants soap opera style.<br /><br />It also borrows from an early CBS game show pioneer- Beat The Clock- by inventing situations for its contestants to try & overcome. Then it rewards the winner money. If they can spice it up with a little interaction between the characters, even better. While the game format is in slow motion versus Beat The Clock- the real accomplishment of this series is to escape reality. <br /><br />This show has elements of several types of successful past programs. Reality television, hardly, but if your hooked on the contestants, locale or contest, this is your cup of tea. If your not, this entire series is as I say, drivel dripping with gravy. It is another show hiding behind the reality label which is the trend it started in 2000.<br /><br />It is slick & well produced, so it might last a while yet. After all, so do re-runs of Gilligan's Island, Green Acres, The Beverly Hillbillies & The Brady Bunch. This just doesn't employ professional actors. The intelligence level is about the same.": 3,
          "When i got this movie free from my job, along with three other similar movies.. I watched then with very low expectations. Now this movie isn't bad per se. You get what you pay for. It is a tale of love, betrayal, lies, sex, scandal, everything you want in a movie. Definitely not a Hollywood blockbuster, but for cheap thrills it is not that bad. I would probably never watch this movie again. In a nutshell this is the kind of movie that you would see either very late at night on a local television station that is just wanting to take up some time, or you would see it on a Sunday afternoon on a local television station that is trying to take up some time. Despite the bad acting, cliché lines, and sub par camera work. I didn't have the desire to turn off the movie and pretend like it never popped into my DVD player. The story has been done many times in many movies. This one is no different, no better, no worse. <br /><br />Just your average movie.": 3,
          "I see that C. Thomas Howell has appeared in many movies since his heyday in the 80s as an accomplished young actor.<br /><br />I bought this DVD because it was cheap and in part for the internet-related plot and to see how much older C. Thomas Howell is; I do not recall seeing him in any movies since the 1980s.<br /><br />In just a few words: what a very big disappointment. I give some low budget movies a chance, but this one started out lame. Within the first 15 minutes of the movie, this elusive woman is chatting with an Asian guy in a chatroom. They basically stimulate themselves to their own chat, she then insists on meeting the participant in person. She meets him, has sex, ties him up and then murders him in cold blood. The plot then deteriorates further.<br /><br />The plot is thin and flimsy and the acting is very stiff. Do not bother renting it much less purchasing it, even if it is in the $1 DVD bin. I plan to take my copy of the DVD to Goodwill. I am truly amazed that any of the prior reviewers here gave this movie a bad rating.": 3,
          "I enjoyed Carax's \"Les Amants du Pont Neuf\" and was therefore expecting this film to be of a similar standard. Well, the first 10 minutes were OK, but then it disintegrates into a rather pretentious journey of a young man looking for the essence of life. A sad disappointment.": 2,
          "Love it, love it, love it! This is another absolutely superb performance from the Divine Miss M. From the beginning to the end, this is one big treat! Don't rent it- buy it now!": 2,
          "I wish Depardieu had been able to finish his book and see it become a dazzling success. At least he'd have wound up with something.<br /><br />The film struck me as pointless, rambling, and very stylish, like some other recent French films. Not to knock it. Most recent American films are pointless and rambling and have no style whatever. We should be grateful, I suppose, for photography that evokes a European city in the midst of a wind-blown Continental winter, and for elliptical conversations that challenge our ability to understand what's up.<br /><br />But there can be too much of a good thing. Golubeva is found stumbling around near the sea in the middle of the freezing night, carrying on in a bad accent about dreams and such. (There are a few sequences of dreams that include things like swimming in a river of blood. You'll love it if you're Vlad the Impaler.) Lots of people die. Catherine Deneuve dies in a suicide by motorcycle. I don't know why. Golubeva's young girl dies too, and I don't know why she dies either. She gets slapped in the face, falls to the pavement, and dies.<br /><br />There is supposedly an explicit sex scene too. I'll have to take their word for it because, although it is stylishly photographed, it is stylishly photographed in almost complete darkness. Don't worry about the kiddies being shocked. They'll probably be asleep by this time anyway.<br /><br />Depardieu isn't a bad actor. As we see him deteriorate from a carefully groomed handsome young man -- well, handsome except that his nose can't seem to get out of his way -- to a limping, murderous, hairy physical wreck, we feel sorry for the guy. Golubeva has a wan pretty face, with enormous half-lidded eyes and wide cheeks, like a doll. Her next movie should be a remake of Lewton's \"I Walked With a Zombie.\" Then there is this mysterious guy who leads a band. I guess it's a band. As far as I could make out, the band is made up of about a dozen drummers and a dozen musicians playing electric guitars. Every viewer will find the resultant sound interesting but uncultivated listeners fond of \"easy listening\" might not enjoy it. If you don't like the music, there's a payoff involved because the sinister composer and leader gets whacked over the head with Depardieu's walking stick.<br /><br />I must say, I found it barely worth sitting through. (And it's a longie, too.) At times it was like waiting in your car at a railroad crossing while a long long freight train rumbles slowly by, sometimes stopping entirely. I wish it had had a few jokes.": 2,
          "I have always been a fan of the show so I'll admit that I am biased. When the show's run ended, I felt like too many questions remained unanswered. This movie to me felt like closure. To see all the people I'd followed over the past few years together at last was most rewarding. I have heard that this is probably the only Homicide movie that we can expect. If that is so, this is the appropriate way to go out. This movie is sometimes poignant, sometimes upsetting, but always satisfying. If you are or ever have been a fan of the show, watch this movie.": 2,
          "This movie starts at A and never quite reaches B. Its title promises far more than the film delivers. It's superficial and filled with the usual cliches of a story in which a guy questions his sexuality. The people are agreeable, even the obligatory flamboyant type. The lead (Kevin McKidd) overacts insofar as there's a reason for him to act at all. Simon Callow, playing a horny straight, is always worth watching, and he's by far the only reason to stay with the movie. However, the rubbish about his men's group \"meditations\" or whatever they are grows extremely tiresome in short order. They seem to have been thrown into the movie's mild mix in a misguided effort to vary the setting and non-stop inaction. The same comment applies to a really odd and unconvincing camping trip. Don't worry about pausing the tape so you can get a snack. Let the thing run; you won't miss anything. Hugo Weaving's character is superfluous. He appears in a sequence with one of the lesser leads and doesn't even meet the rest at all. The outcome of that sequence isn't explained, and Hugo's real estate dealings have nothing to do with the story. The movie is a total disappointment at the end, because there is no resolution. The thing simply fades out and we're sent to the closing credits. This is an interlude with no structure.": 2,
          "Most movies I can sit through easily, even if I do not particularly like the movie. I am the type of person who recognizes great films even if I do not like the genre. This is the first movie I could not stand to watch. Cat in the Hat is the worst movie I have ever seen--and I've seen a lot of movies. The acting is okay (Myers is good as the cat, it's just that he is REALLY annoying). The silly songs the cat sings were boring and monotonous, even for the children in the audience. The plot drags on and on, and viewers must suffer through poor dialogue. The \"witty\" parental remarks are disgusting, not funny (I remember some awful comment about a garden hoe being compared to, well, a type of person people call a \"ho\"). Even though the movie is really short, it seemed to last FOREVER. Do not waste your time. I know small kids who hated this movie. If children can't stand it, I do not know how any adults can. I would like to fume more about this film but I do not even feel like wasting anymore time writing this review about it. I HATED IT! So, in summary, do not spend 90 minutes of your life watching this! See a GOOD movie!<br /><br />1/10 stars--the lowest review I have ever given a movie.": 2,
          "Alfred Hitchcock invented any kind of thriller you could think of:he set the standards so high that any director who makes a suspense movie will be fatally compared to him.<br /><br />The main subject of this Bullock vehicle ,all the ideas,almost everything was already in Hitchcock's classic \" Rope\":the two students who commit a gratuitous crime, Nietsche's philosophy,and the clues that the boys disseminate ,the Master was the first to transfer them to the screen.And with an eighty-minute movie which was a technical riveting tour de force.<br /><br />\"Murder by numbers \" does not take place in a single room,like \"the rope\" ,mind you.And ,what a supreme originality,it pits two cops against the evil youngsters;and ,you would never guess it,these two cops are very different:actually,Bullock plays the part of woman living like a man ,and her partner (Chaplin) is as shy as a clueless girlie.The two boys' performances are not really mind-boggling ,not as good ,as ,say ,that of Edward Norton in \"primal fear\" .<br /><br />Well,you know ,\" Rope\" was so good ....": 2,
          "I really liked the idea of traveling between dimensions, and I even liked the Wade/Quinn tension in early episodes. Some of the worlds they created gave the main characters extremely interesting backdrops for their stories. However, as the show went on there were more silly disputes among the friends and less of a true bond. There was less wonder and excitement when they were involved in other worlds and more condescension. And every world had one of the characters falling in love. The writing just got boring and everything was way too over the top. Too bad it would've been nice to have a closely knit band of friends (a la Star Wars) traveling to different dimensions on TV for several years, rather than a tired band of knit pickers.": 2,
          "What the heck is this about? Kelly (jennifer) seems to drop all moral behavior as soon as she arrives to the island. She finds this Juan P (Manuel) existing and exotic, though she witnessed when he slapped his ex in the face, which he also justify later on in the movie, right or wrong? These two guys are the first to find each other on the island. Kelly are totally lost in every sense and the great Juan P can fish and built a somewhat house. Mr handyman. They seem to have a great time. Then Billy Zane (Jack, Kellys characters husband) shows up and of course, two days without knowing what his wife has been doing whit this gorgeous Juan P, he is a little bit jealous. Billy Z is the stereotype rich guy and maybe not the nicest man in the world. He dislikes Juan P (for hitting his girlfriend at the pier, who can blame him? Hes also is arrogant, but he paid loads of money to rent that boat and Juan P who is the waiter/everything cant even fetch him a beer whit in 20 min. Wouldn't you be upset? Yet Billy is probably the guy you want to punch in the face if you meet him. But at the same time, he is, not to be blamed for, suspicious about the scuba goggles Manuel has. Kelly and Billy just lost some dear friends! How convenient he just happens to have them, no matter what!). However, for some strange reason Kelly likes this girl hitting Manuel and starts to hate Billy for being jealous. OK, Billy is overreacting, thats for sure, but Kelly isn't doing much to convince him either. She spends more time with Juan P and even wants him to sleep with them since hes been so nice (and even though Manuel yelled at her and calling her things for asking him some intimate questions. But Kelly is SO forgiving...). Yeah right. And then she starts to have sex with this Juan P. It should be said that Kelly and Billy seems to have a working relationship before this island incident, at least, they have intimate sex on the boat and talks like people do when they like each other. Now, you can think that this scenario is possible. But for real, is it? Are you cheating your husband after two days on a coconut island just because hes jealous and acts like a drunk in the bar? (i wouldn't disagree if there relationship was really bad but the director doesn't give much hints if thats the case). For Christ sake, Juan P hasn't really shown himself being a good person. Catching some fish and built a wood house to get into someones panties, is that showing a good side? Not trying to befriend Kellys husband in anyway (which would be very simple by letting them be alone most of the island-time, simply be respect) He doesn't care about their relationship (and Kelly cant figure that one out), he just want to have sex with Kelly. Kellys character is just not trustworthy (if she was stranded with Billy and another attractive girl, wouldn't she be upset or what?!). Or maybe she is? Billy Zane plays a not very nice person, and Juan P isn't actually much better if you really think about it. And poor Kelly is so confused, and believes having sex with Juan P will solve everything because her husband is so strange and so aggressive towards poor Juan P? So... for all of you who reads this... What do you think about it? If you where the Kelly character, would you consider cheating on your husband, knowing one day you'll be back in real life, and all of a sudden Billys maybe not that horrible person after all. Hes just too jealous. And if you where Billys character, what do you say, is he totally wrong in his behavior? And Juan P character what do you guys really think of him. One thing is for sure. Manuels exist! Ps... The voodoo thing is so totally wrong here! What the heck was that about?! Seriously! Anyone tell me?": 2,
          "Jack Frost returns with an army of Styrofoam balls that can only be foiled by being shot with super-soakers loaded with margaritas. How's that for a plot? The film hinges on such a ridiculous premise that it barely raises an eyebrow when characters are killed with BBQ tongs and are impaled by carrots. You might even say the whole movie is skating on thin ice (ba-boom-tish).<br /><br />Admittedly, there are some fantastic one-liners including a remark about the Murderous Coconut Shark.<br /><br />Fair enough times are hard, but that does not excuse the willingness of the actors to take part in such utter tripe.<br /><br />For those fans hoping to see Jack Frost, be prepared to accept him as merely a phallic carrot creeping up the beach with corny voice-over commentary.": 2,
          "I was one of those \"few Americans\" that grew up with all of Gerry Andersen's marvelous creations. Thunderbirds was a great series for the time and would have made a great action/adventure movie if only the writers could have figured out where to target it.<br /><br />I expected it to be a romp, but I did not expect it to aim at such a low age group. Like Lost in Space, this could have been both visually stunning and exciting. It should have focused on more action/adventure and the goal of the original series... saving people in trouble.<br /><br />Instead, it focused on Alan saving the day instead of his brothers (who were cast too young anyway vs. the original). The breakout part was Lady Penelope and Parker. I didn't care too much for the characters in the original, but I was grateful for them in the movie. They stole the show!<br /><br />I always enjoyed Thunderbirds more for the high-tech than the stories, and even that did not get enough screen time as far as I was concerned. I would have enjoyed seeing more of the cool gadgets.<br /><br />But then, I'm just a big kid... ;)": 2,
          "This movie was NOTHING like the book. I think the writer of the screenplay must have wanted the job of writing the sequel to Gone with the Wind and been turned down. This was his or her way of getting their ideas in anyway. The only similarity between this movie and the story it was portraying was the names of the principle characters and the location of the main action. None of the events that are shown in the movie happened that way in the book. For a Gone with the Wind fan (of both the book and the movie) this was deeply disappointing. If you loved the book Scarlett, don't watch this movie hoping to see it played out on the screen. They only share the title in common.": 2,
          "This movie is amazing. You will NEVER laugh harder. It's a target. No, I think it's...yes it's...A BOOB! This movie gets funnier by the second--like when Jackie Chan's character finally dies in his final fight scene. This movie is velly velly seekwet like treasha! Congrats if you buy or rent this. You'll never return it, in my opinion. I didn't, and I haven't found it in a store since. I watched this movie once and I was forever in love with Kung-Fu action flicks. If you're looking for an amazing film in the realm of great production value, good or even mediocre acting, and good special effects...this is NOT that movie. If you're looking for laughs and timeless wonderment, pick this up for a dollar and you'll probably never let it go. With friends, popcorn and drinks, it's the perfect evening.": 2,
          "when I first heard about this movie, I noticed it was one of the most controversial films of the 1970s. I noticed the music was by Elton John, so I figured I had nothing to loose, so I got it. What a Surprise!!! The movie was awesome. It was true love is all about. The characters (Paul and Michelle) had no luxuries, no money, and sometimes no food, yet they were still happy. I recommended this film to all my friends, but they all critized my tastes, and even called me names, becuase the movie featured two minors naked. I think that only made the movie more realistic. The cinematography was great and it only come to show the great abilities of director Lewis Gilbert": 2,
          "Everyone knows about this ''Zero Day'' event. What I think this movie did that Elephant did not is that they made us see how these guys were. They showed their life for about a year. Throughout the movie we get to like them, to laugh with them even though we totally know what they're gonna do. And THAT gives me the chills. Cause I felt guilty to be cheered by their comments, and I just thought Cal was a sweet guy. Even though I KNEW what was gonna happen you know? Even at the end of the movie when they were about to commit suicide and just deciding if they did it on the count of 3 or 4 I thought this was funny but still I was horrified to see their heads blown off. Of course I was. I got to like them. They were wicked, maybe, but I felt like they were really normal guys, that they didn't really realize it. But I knew they were.<br /><br />That's, IMO, the main force of this movie. It makes us realize that our friends, or relatives, or anyone, can be planning something crazy, and that we won't even notice it. This movie, as good as it was, made me feel bad. And that's why I can't go to sleep right now. There's still this little feeling in my stomach. Butterflies.": 2,
          "With Knightly and O'Tool as the leads, this film had good possibilities, and with McCallum as the bad guy after Knightly, maybe some tension. But they threw it all away on silly evening frill and then later on with maudlin war remnants. It was of course totally superficial, beautiful English country and seaside or not.The number one mistake was dumping Knightly so early on in the film, when she could easily have played someone a couple of years older, instead of choosing someone ten years older to play the part. They missed all the chances to have great conflict among the cast, and instead stupidly pulled at the easy and low-cost heartstring elements.": 2,
          "I've tried to reconcile why so many bad reviews of this film, while the vast majority of reviews are given a rating of between 7 and 10. The reason may be this film is kind of hard to describe in a positive review, although a few have done that quite nicely already. This film is confusing, depressing, and doesn't have a happy ending. I still gave Pola X a rating of 10, because it is basically for me literature and art combined on film. That is really my favorite kind of filmmaking. I've only seen two of Carax's films: this one and Mauvis Sang. As with this film, I'm being somewhat pretentious when I call this one of Carax's best films- but I am. Carax has a minimalist style. If that type of film does not appeal to you and is boring, then it would be best not to watch this. But Pola X was less minimalist than Mauvis Sang, so it had quite a lot of intensity for a thriller- at least for my taste. I found it quite interesting and absorbing. The two lead roles did an excellent job acting. (I mean the lead and the young woman he thought was his half sister.) Catherine D. is always great, but her role was not very large or significant in the story. But everyone did a fine job. I thought the cult stuff was great. It may have not been very believable, but that is due to its being rather abstract. There is a lot going on between the lines in this film. This is a very Freudian psycho-thriller.": 2,
          "Although I can see the potentially redeeming qualities in this film by way of it's intrigue, I most certainly thought that the painfully long nature in the way the scene structure played out was too much to ask of most viewers. Enormous holes in the screenplay such as the never explained \"your father died today\" comment by the mother made it even harder to try to make sense of these characters.<br /><br />This won first place at Cannes in 2001 which is a shock considering. Perhaps the French had been starved for film noir that year and were desperate for something as sadistic as this film. I understood the long scenes as a device to keep the viewer as uncomfortable as possible but when matched with the inability to relate to the main character it went too far for me and kept me at arms distance from the story altogether.<br /><br />This is a film for only the most dedicated fan of film noir and one who expects no gratification from having watched a film once it's over. I LOVED movies such as \"Trainspotting\" or \"Requiem for a Dream\" - which were far more disturbing but at least gave the viewer something in the way of editing and pacing. To watch this teachers slow and painful silence scene after scene just became so redundant that I found it tedious - and I really wanted to like this film at every turn.": 2,
          "At first the movie seemed to be doing great, they had the characters profiles set...the plot seemed to be going in the right direction... however, as the movie progressed it seemed the director focused on the wrong kind of things...or just a lot was edited from the movie. The characters' identities changed for the worse within the movie. Also, there seemed to be a lot of implicit meaning -- in other words -- they had things within the movie that didn't seem to fit the movie itself. AND the title... no where in the movie does the title fit the movie...I suppose the title works for the previews.... Actors did well with what they had.....if they had a better director and writer, maybe this would have worked out better. But it didn't. So now there's a new terrible movie coming out this Friday.... My opinion!....don't waste your time or money.": 2,
          "If this is not heavily featured on every list of \"what not to watch\", it should only be because those keeping that particular list are not aware of its existence, which, as long as that remains so, is the acceptable alternative. I'm not kidding you, this is a *bad* \"movie\". Joseph Meeker returns from the dead, with various vague, undefined supernatural powers, the most employed of which would seem to be appearing in new, increasingly comical-looking and ridiculous(and never scary or creepy... in general, when this goes for the latter of those, it winds up just being bizarre, and attempts at the former just don't work, period) outfits and stereotypes/archetypes, and he is portrayed by David Keith(whom I respect in... well, at least Daredevil), doing a more often than not terribly inconsistent(which could also have to do with script) and often over the top performance. A character or two have personalities so unbelievably irritating that they're painful to watch. The editing thinks it's considerably more clever than it really is(and what on Earth was with the red tint for the flashbacks?). Cinematography... oh, dear. Framing, coverage, effective use of angle(that one could be attributed some to editing, too, perhaps), please, guys, stop me when I say something you've ever heard about the existence of. As far as the technical side goes, this is a pretty lousy excuse for something more worthwhile to put in the projector than unexposed film. But why stop there? The plot is just poor. The basic idea's been done, and it's been done so much better than this(The Crow would be one). The way it's told is gimmicky, and while there is some explanation behind the flashbacks, it still doesn't satisfy. Pacing is about non-existent. The lead is distinctly unlikeable, and there's more personality in a barn door, not to mention that those are also considerably less wooden. Kelly Perine and Thomas Ian Nicholas? What in the name of all that is good and just(pun intended) are you doing in this? Perine, you were already funny before this, on The Drew Carey Show, Nicholas, well, I haven't seen you in anything preceding American Pie, but if nothing else, you *were* funny later on, and in those productions, the amusement was intentional. Dialog is... the less said, the better. Language is unrestrained, and tends to be stupid. The violence is shoddily done, and they don't even seem to care to try to hide it(hinting at it might have been the smarter strategy). Characters, don't get me started. Why spend so much energy on portraying unexciting, at times utterly illogical, events? The more you think about this, the worse it gets. It's not even passable as a \"bad horror flick\", or a B movie(it may very well pass through the rest of the alphabet, and go further still), it couldn't scare you on the scariest day of your life if it had an electrified scaring machine. I recommend this only to people who want to disprove how bad this is, and don't say I didn't warn ya. 1/10": 2,
          "I absolutely hate this programme, what kind of people sit and watch this garbage?? OK my dad and mum love it lol but i make sure I'm well out of the room before it comes on. Its so depressing and dreary but the worst thing about it is the acting i cant stand all detective programmes such as this because the detectives are so wooden and heartless. What happened to detective programmes with real mystery??? I mean who wants to know what happened to fictional characters we know nothing about that died over 20 years ago??? I wish the bbc would put more comedy on bbc1 cos now with the vicar of dibley finished there is more room for crap like this.": 2
        }
      },
      "sentiment": {
        "nunique": 2,
        "top_values": {
          "positive": 25000,
          "negative": 25000
        }
      }
    }
  },
  "missingness_summary": {
    "rows_with_any_missing": 0,
    "rows_with_any_missing_pct": 0.0,
    "per_column": {
      "review": {
        "missing": 0,
        "missing_pct": 0.0
      },
      "sentiment": {
        "missing": 0,
        "missing_pct": 0.0
      }
    }
  },
  "target_preview": {
    "target": null
  }
}